# Filter

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
    'degisken1': [10, 23, 33, 22, 11, 99],
    'degisken2': [100, 253, 333, 262, 111, 969]}, 
    columns=['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [3]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [4]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [5]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

# Transform

In [7]:
df["degisken1"] * 9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [13]:
df_a = df.iloc[:, 1:3]

In [15]:
df_a.transform(lambda x: (x - x.mean()) / x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

In [16]:
# Sonuc olarak transform fonksiyonu tum degiskenler icin islem yapabilmemize olanak taniyan vektorel bir fonksiyondur.

# Apply

In [20]:
import pandas as pd
import numpy as np 

df = pd.DataFrame({
    'degisken1': [10, 23, 33, 22, 11, 99],
    'degisken2': [100, 253, 333, 262, 111, 969]}, 
    columns=['degisken1', 'degisken2'])
df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [21]:
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [22]:
df.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64